---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementHasMultipleConnectors
source: html/e6e42445-1aba-2394-57bd-19ed3db81f44.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementHasMultipleConnectors Property

Revit found one or more elements with multiple connectors. Select each element and then select the connectors to use for the analytical connection.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementHasMultipleConnectors { get; }
```